redis/redis-guide.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-13 二 10:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>redis 入门指南读书笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="刘尚亮" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">redis 入门指南读书笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3e6f89b">1. 简介</a></li>
<li><a href="#org6a83bea">2. 准备</a>
<ul>
<li><a href="#org0fbf5ad">2.1. 安装</a></li>
<li><a href="#org607d648">2.2. 启动和停止</a></li>
<li><a href="#orgb4c5868">2.3. 配置文件</a></li>
</ul>
</li>
<li><a href="#org98d1753">3. 入门</a>
<ul>
<li><a href="#org61d722f">3.1. 字符串</a></li>
<li><a href="#org302a4c8">3.2. 散列</a></li>
<li><a href="#org6fc2242">3.3. 列表</a></li>
<li><a href="#org7bb17e8">3.4. 集合</a></li>
<li><a href="#orgf85771e">3.5. 有序集合</a></li>
</ul>
</li>
<li><a href="#org270b420">4. 进阶</a>
<ul>
<li><a href="#org27a4aed">4.1. 事务</a></li>
<li><a href="#orgc723d4a">4.2. 生存时间</a></li>
<li><a href="#org645220d">4.3. 排序</a></li>
<li><a href="#org477fdd4">4.4. 消息通知</a></li>
<li><a href="#org6da7bf1">4.5. 管道</a></li>
<li><a href="#org13dc2a9">4.6. 节省空间</a></li>
</ul>
</li>
<li><a href="#org315ba51">5. 实践</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3e6f89b" class="outline-2">
<h2 id="org3e6f89b"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>存储结构：字符串、散列、列表、集合、有序集合。</li>
<li>主要用来做数据库、缓存系统、消息队列。</li>
</ul>
</div>
</div>
<div id="outline-container-org6a83bea" class="outline-2">
<h2 id="org6a83bea"><span class="section-number-2">2</span> 准备</h2>
<div class="outline-text-2" id="text-2">
<p>
测试环境：
</p>
<div class="org-src-container">
<pre class="src src-sh">uname -a
</pre>
</div>
</div>
<div id="outline-container-org0fbf5ad" class="outline-3">
<h3 id="org0fbf5ad"><span class="section-number-3">2.1</span> 安装</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-sh">sudo apt install redis-server redis-tools
</pre>
</div>
</div>
</div>
<div id="outline-container-org607d648" class="outline-3">
<h3 id="org607d648"><span class="section-number-3">2.2</span> 启动和停止</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>通过 redis-server 启动服务器</li>
<li>通过 redis-cli 执行命令</li>
</ul>
</div>
</div>
<div id="outline-container-orgb4c5868" class="outline-3">
<h3 id="orgb4c5868"><span class="section-number-3">2.3</span> 配置文件</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>初始化脚本放在/etc/init/redis_端口号</li>
<li>配置文件/etc/redis/端口号.conf</li>
<li>持久化文件/var/redis/端口号</li>
<li>配置项：daemonize、pidfile、port、dir。</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org98d1753" class="outline-2">
<h2 id="org98d1753"><span class="section-number-2">3</span> 入门</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>所有的 Redis 命令都是原子操作。</li>
</ul>
</div>
<div id="outline-container-org61d722f" class="outline-3">
<h3 id="org61d722f"><span class="section-number-3">3.1</span> 字符串</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>可执行的操作：SET、GET、MSET、MGET、SETNX、INCR、INCRBY、INCRBYFLOAT、DECR、DECRBY、APPEND、STRLEN、GETBIT、SETBIT、BITOP</li>
</ul>
</div>
</div>
<div id="outline-container-org302a4c8" class="outline-3">
<h3 id="org302a4c8"><span class="section-number-3">3.2</span> 散列</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>散列的值只能是字符串。</li>
<li>可执行的操作：HSET、HGET、HMSET、HMGET、HGETALL、HSETNX、HINCRBY、HDEL</li>
</ul>
</div>
</div>
<div id="outline-container-org6fc2242" class="outline-3">
<h3 id="org6fc2242"><span class="section-number-3">3.3</span> 列表</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>列表的内部是使用双向列表实现的。</li>
<li>可执行的操作：
<ul class="org-ul">
<li>LPUSH、LPOP</li>
<li>RPUHS、RPOP</li>
<li>LLEN、LRANGE、LREM、LINDEX、LTRIM、LINSERT、RPOPLPUSH</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org7bb17e8" class="outline-3">
<h3 id="org7bb17e8"><span class="section-number-3">3.4</span> 集合</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>集合内不使用值为空的散列表实现。</li>
<li>可执行的操作：SADD、SREM、SMEMBERS、SISMEMBER、SDIFF、SINTER、SUNION、SCARD、SDIFFSTORE、SINTERSTORE、SUNIONSTORE、SRANDMEMBER、SPOP</li>
</ul>
</div>
</div>
<div id="outline-container-orgf85771e" class="outline-3">
<h3 id="orgf85771e"><span class="section-number-3">3.5</span> 有序集合</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>有序集合是使用散列表和跳跃表实现的。</li>
<li>有序集合比列表类型更耗内存。</li>
<li>可执行的操作：ZADD、ZSCORE、ZRANGE、ZREVRANGE、ZRANGEBYSCORE、ZINCRBY、ZCARD、ZCOUNT、ZREM、ZREMRANGEBYRANK、ZREMRANGEBYSCORE、ZRANK、ZINTERSTORE</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org270b420" class="outline-2">
<h2 id="org270b420"><span class="section-number-2">4</span> 进阶</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org27a4aed" class="outline-3">
<h3 id="org27a4aed"><span class="section-number-3">4.1</span> 事务</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>命令：MULTI、EXEC、WATCH</li>
<li>如果执行时候事务中的一条命令出错了，事务中的其他命令还是会继续执行。</li>
<li>事务没有回滚操作。</li>
</ul>
</div>
</div>
<div id="outline-container-orgc723d4a" class="outline-3">
<h3 id="orgc723d4a"><span class="section-number-3">4.2</span> 生存时间</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>命令：EXPIRE、TTL、PERSIST、PEXPIRE</li>
<li>使用 SET 或 GETSET 命令为键赋值会清楚键的生存时间。</li>
</ul>
</div>
</div>
<div id="outline-container-org645220d" class="outline-3">
<h3 id="org645220d"><span class="section-number-3">4.3</span> 排序</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>命令：SORT、BY、GET、STORE</li>
<li>SORT 命令的时间复杂度是 O(n+mlogm)。</li>
</ul>
</div>
</div>
<div id="outline-container-org477fdd4" class="outline-3">
<h3 id="org477fdd4"><span class="section-number-3">4.4</span> 消息通知</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>命令：BRPOP、PUBLISH、SUBSCRIBE、PSUBSCRIBE PUNSUBSCRIBE</li>
<li>如果先 publish，然后 subscribe，将收不到信息。</li>
</ul>
</div>
</div>
<div id="outline-container-org6da7bf1" class="outline-3">
<h3 id="org6da7bf1"><span class="section-number-3">4.5</span> 管道</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li>管道通过减少客户端与 Redis 的通信次数来实现降低往返时延累计值的目的。</li>
</ul>
</div>
</div>
<div id="outline-container-org13dc2a9" class="outline-3">
<h3 id="org13dc2a9"><span class="section-number-3">4.6</span> 节省空间</h3>
<div class="outline-text-3" id="text-4-6">
<ul class="org-ul">
<li>精简键名和键值。</li>
<li>内部编码优化，Redis 为每种数据类型提供了两种内部编码实现：（需要深入了解）
<ul class="org-ul">
<li>字符串：raw、int</li>
<li>散列：ht、ziplist</li>
<li>列表：linkedlist、ziplist</li>
<li>集合：ht、intset</li>
<li>有序集合：skiplist、ziplist</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org315ba51" class="outline-2">
<h2 id="org315ba51"><span class="section-number-2">5</span> 实践</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 刘尚亮</p>
<p class="email">Email: <a href="mailto:phenix3443@gmai.com">phenix3443@gmai.com</a></p>
<p class="date">Created: 2019-08-13 二 10:41</p>
<p class="validation"></p>
</div>
</body>
</html>
